export const rolesData = [
    // ฝ่ายชาวบ้าน
    { id: 'v1', team: 'human', name: 'ชาวบ้าน', en: 'Villager', p: 1, desc: 'หาตัวหมาป่าให้เจอและกำจัดทิ้ง' },
    { id: 'v2', team: 'human', name: 'เทพพยากรณ์', en: 'Seer', p: 7, desc: 'ตรวจสอบผู้เล่นว่าเป็นหมาป่าหรือไม่' },
    { id: 'v3', team: 'human', name: 'จอมเวท', en: 'Spellcaster', p: 1, desc: 'เลือกผู้เล่นหนึ่งคนห้ามพูดในวันถัดไป' },
    { id: 'v4', team: 'human', name: 'กามเทพ', en: 'Cupid', p: -3, desc: 'เลือกคู่รัก 2 คน หากคนใดคนหนึ่งตาย อีกคนจะตายตาม' },
    { id: 'v5', team: 'human', name: 'บอดี้การ์ด', en: 'Bodyguard', p: 3, desc: 'ปกป้องผู้เล่น 1 คน (ห้ามเลือกตัวเอง/ซ้ำคืนเดิม)' },
    { id: 'v6', team: 'human', name: 'ญาณทิพย์', en: 'Aura Seer', p: 3, desc: 'ตรวจสอบว่าผู้เล่นเป็นบทบาทพิเศษหรือไม่' },
    { id: 'v7', team: 'human', name: 'ขี้เมา', en: 'Drunk', p: 4, desc: 'คืนที่ 3 ถึงจะรู้บทบาทจริงของตัวเอง' },
    { id: 'v8', team: 'human', name: 'เจ้าชาย', en: 'Prince', p: 3, desc: 'หากถูกโหวตประหาร จะไม่ตายและต้องเผยบทบาท' },
    { id: 'v9', team: 'human', name: 'นักบวช', en: 'Priest', p: 3, desc: 'ปกป้องผู้เล่นให้รอดจากการตายได้ 1 ครั้ง' },
    { id: 'v10', team: 'human', name: 'นักสืบเรื่องลี้ลับ', en: 'P.I.', p: 3, desc: 'ตรวจสอบผู้เล่นและคนข้างๆ ว่ามีหมาป่าหรือไม่' },
    { id: 'v11', team: 'human', name: 'ตัวป่วน', en: 'Troublemaker', p: -3, desc: 'ทำให้มีการโหวตกำจัดคนได้ 2 คนในวันถัดไป' },
    { id: 'v12', team: 'human', name: 'แม่มด', en: 'Witch', p: 4, desc: 'มียาชุบและยาฆ่า อย่างละ 1 ขวดต่อเกม' },
    { id: 'v13', team: 'human', name: 'แม่หมอ', en: 'Old Hag', p: 1, desc: 'เลือกสาปผู้เล่นให้ออกจากหมู่บ้าน 1 วัน' },
    { id: 'v14', team: 'human', name: 'ศิษย์เทพพยากรณ์', en: 'Apprentice Seer', p: 4, desc: 'ถ้าเทพพยากรณ์ตาย คุณจะกลายเป็นเทพพยากรณ์แทน' },
    { id: 'v15', team: 'human', name: 'นายกเทศมนตรี', en: 'Mayor', p: 2, desc: 'เสียงโหวตของคุณมีค่าเท่ากับ 2 เสียง' },
    { id: 'v16', team: 'human', name: 'นายพราน', en: 'Hunter', p: 3, desc: 'หากตาย สามารถเลือกกำจัดคนอื่นตายตามได้ทันที' },
    { id: 'v17', team: 'human', name: 'ผู้ป่วยติดเชื้อ', en: 'Disease', p: 3, desc: 'ถ้าหมาป่ากินคุณ คืนถัดไปหมาป่าจะฆ่าใครไม่ได้' },
    { id: 'v18', team: 'human', name: 'ผู้รักสันติ', en: 'Pacifist', p: -1, desc: 'ต้องโหวตให้ผู้เล่นรอดเสมอ' },
    { id: 'v19', team: 'human', name: 'พรายกระซิบ', en: 'Ghost', p: 2, desc: 'ตายคืนแรก และสื่อสารได้วันละ 1 ตัวอักษร' },
    { id: 'v20', team: 'human', name: 'ภราดรแห่งเมสัน', en: 'Mason', p: 2, desc: 'รู้จักเพื่อนที่เป็น Mason ด้วยกันตั้งแต่คืนแรก' },
    { id: 'v21', team: 'human', name: 'ภูตจำแลง', en: 'Doppelganger', p: -2, desc: 'เลือกคนหนึ่ง เมื่อคนนั้นตายคุณจะสวมรอยเป็นบทบาทนั้น' },
    { id: 'v22', team: 'human', name: 'ลูกครึ่งหมาป่า', en: 'Lycan', p: -1, desc: 'คนอื่นจะมองเห็นคุณเป็นหมาป่า' },
    { id: 'v23', team: 'human', name: 'หนุ่มถึก', en: 'Tough Guy', p: 3, desc: 'ถ้าถูกหมาป่าฆ่า จะยังไม่ตายจนกว่าจะถึงคืนถัดไป' },
    { id: 'v24', team: 'human', name: 'ไอ้ทึ่ม', en: 'Villager Idiot', p: 2, desc: 'ต้องโหวตให้ผู้เล่นถูกกำจัดเสมอ' },
    { id: 'e1', team: 'human', name: 'ผู้เผยตัวตน', en: 'Revealer', p: 4, desc: 'ชี้หมาป่าถ้าชี้ถูกหมาป่าจะตาย ถ้าผิดคุณตายแทน' },
    { id: 'e2', team: 'human', name: 'นักสะกดจิต', en: 'Mentalist', p: 6, desc: 'ตรวจสอบว่าผู้เล่น 2 คนอยู่ฝั่งเดียวกันหรือไม่' },
    { id: 'e3', team: 'human', name: 'พรานหญิง', en: 'Huntress', p: 3, desc: 'สามารถเลือกฆ่าคนได้ 1 ครั้งในช่วงกลางคืน' },
    { id: 'e5', team: 'human', name: 'เทพผู้รู้แจ้ง', en: 'Mystic Seer', p: 9, desc: 'รู้บทบาทที่แท้จริงของผู้เล่นที่ตรวจสอบทันที' },
    
    // ฝ่ายหมาป่า
    { id: 'w1', team: 'wolf', name: 'มนุษย์หมาป่า', en: 'Werewolf', p: -6, desc: 'เลือกกำจัดผู้เล่น 1 คนในทุกๆ คืน' },
    { id: 'w2', team: 'wolf', name: 'หมาป่าเดียวดาย', en: 'Lone Wolf', p: -5, desc: 'ชนะเมื่อเหลือรอดเป็นคนสุดท้ายคนเดียวเท่านั้น' },
    { id: 'w3', team: 'wolf', name: 'ลูกหมาป่า', en: 'Wolf Cub', p: -8, desc: 'ถ้าตาย หมาป่าจะฆ่าได้ 2 คนในคืนถัดไป' },
    { id: 'w4', team: 'wolf', name: 'สมุนรับใช้', en: 'Minion', p: -6, desc: 'รู้ว่าใครเป็นหมาป่า แต่ไม่ได้ตื่นมาฆ่าด้วยกัน' },
    { id: 'w5', team: 'wolf', name: 'นางปีศาจ', en: 'Sorcerer', p: -3, desc: 'ค้นหาตัวเทพพยากรณ์ในแต่ละคืน' },
    { id: 'w6', team: 'wolf', name: 'ผู้ต้องคำสาป', en: 'Cursed', p: -3, desc: 'ถ้าถูกหมาป่าเลือกฆ่า จะกลายเป็นหมาป่าแทน' },
    { id: 'e6', team: 'wolf', name: 'หมาป่าจ่าฝูง', en: 'Alpha Wolf', p: -9, desc: 'เปลี่ยนเหยื่อให้เป็นหมาป่าตัวใหม่ (1 ครั้ง)' },

    // ฝ่ายอิสระ
    { id: 'o1', team: 'other', name: 'อันธพาล', en: 'Hoodlum', p: 0, desc: 'เลือกเป้าหมาย 2 คน ถ้าทั้งคู่ตายและคุณรอด คุณชนะ' },
    { id: 'o2', team: 'other', name: 'ยาจก', en: 'Tanner', p: -2, desc: 'ชนะทันทีหากถูกโหวตประหาร' },
    { id: 'o3', team: 'other', name: 'แวมไพร์', en: 'Vampire', p: -7, desc: 'เลือกเหยื่อที่จะตายในวันถัดไป หมาป่าฆ่าคุณไม่ได้' },
    { id: 'o4', team: 'other', name: 'เจ้าลัทธิ', en: 'Cult Leader', p: 1, desc: 'ดึงคนเข้าลัทธิ ชนะเมื่อทุกคนที่เหลืออยู่ในลัทธิ' },
    { id: 'e4', team: 'other', name: 'มือระเบิดพลีชีพ', en: 'Mad Bomber', p: -2, desc: 'ถ้าตาย คนซ้ายและขวาจะตายตามไปด้วย' }
];

